import React from 'react';
import Img from '../image/die.png';

function Helper() {
	
	const [visible, setVisible] = React.useState(false)
	const [visible1, setVisible1] = React.useState(false)
	const [visible3, setVisible3] = React.useState(false)
	const [visible4, setVisible4] = React.useState(false)
	const toggleVisible = () => {
		setVisible(!visible)
	}
	const toggleVisible1 = () => {
		setVisible1(!visible1)
	}
	const toggleVisible3 = () => {
		setVisible3(!visible3)
	}
	const toggleVisible4 = () => {
		setVisible4(!visible4)
	}

    return (
        <div>
             	<section className="faq">
		<div className="faq_title">
			<h1>Питання-відповідь</h1>
		</div>
		<div className="flex-container">

		<div className="flex-item" >
	<div className="faq_block" onClick={toggleVisible}>
	ЩО РОБИТИ ЯКЩО ПОМЕРЛА ЛЮДИНА
	</div>
	{visible && <div className="faq_block_text">
		<img src={Img} alt=""/>
	</div>}
</div>

<div className="flex-item">
	<div className="faq_block" onClick={toggleVisible1} >
	ПОРЯДОК РЕЄСТРАЦІЇ СМЕРТІ
	</div>
	{visible1 && <div className="faq_block_text" >
		<p>Заява про державну реєстрацію смерті подається не пізніше трьох днів з дня настання смерті чи виявлення трупа, а вразі неможливості одержання лікарського свідоцтва про смерть, фельдшерської довідки про смерть- не пізніше п’яти днів.( п.2 розділу 5 глави ІІІ Правил державної реєстрації актів цивільного стану в Україні)</p>
		<p>Державна реєстрація смерті за заявою, поданою у вищевказані строки та до закінчення одного року з дня настання смерті, провадиться за останнім місцем проживання померлого, за місцем настання смерті чи виявлення трупа, або за місцем поховання.( п.3 розділу 5 глави ІІІ Правил державної реєстрації актів цивільного стану в Україні)</p>
		<p>Державна реєстрація смерті провадиться за заявою родичів померлого, представників органу опіки та піклування, працівників житлово-експлуатаційних організацій, адміністрації закладу охорони здоров’я, де настала смерть, та інших осіб . Особа, яка звернулась щодо державної реєстрації смерті, повинна пред’явити паспорт або паспортний документ. ( п.7 розділу 5 глави ІІІ Правил державної реєстрації актів цивільного стану в Україні)</p>
		<ul>Підставою для державної реєстрації смерті є:
		<li>лікарське свідоцтво про смерть ( форма № 106/о, форма якого затверджена Наказом Міністерства охорони здоров’я України від 08.08.2006 № 545 </li>
		<li>фельдшерська довідка про смерть ( форма №106-1/0) , форма якої затверджена Наказом Міністерства охорони здоров’я України від 08.08.2006  № 545</li>
		<li>лікарське свідоцтво про пренатальну смерть</li>
		<li> рішення суду про встановлення факту смерті особи в певний час</li>
		<li> повідомлення установи виконання покарань або слідчого ізолятора, надіслане разом з лікарським свідоцтвом про смерть.( п.1 розділу 5 глави ІІІ Правил державної реєстрації актів цивільного стану в Україні)</li>
		</ul>
		<p>Після державної реєстрації смерті видається витяг з державного реєстру актів цивільного стану громадян про смерть для одержання допомоги на поховання. .( п.15 розділу 5 глави ІІІ Правил державної реєстрації актів цивільного стану в Україні)</p>
	</div>}
</div>


<div className="flex-item">
	<div className="faq_block" onClick={toggleVisible4} >
	ЩО ПОТРІБНО ДЛЯ ПЕРЕМІЩЕННЯ ПОМЕРЛОГО ЗА КОРДОН
	</div>
	{visible4 && <div className="faq_block_text" >
		<p>Переміщення тіл померлих через державний кордон України проводиться згідно статті 22 Закону України «Про поховання та похоронну справу»</p>
		<p>Переміщення тіл померлих через державний кордон України (у тому числі переміщення через територію України транзитом) здійснюється за умови пред’явлення митному органові особою, яка переміщує (супроводжує) тіло померлого, таких документів:</p>
<ul>
<li>свідоцтва про смерть або іншого документа, що засвідчує факт смерті, виданого компетентним органом;</li>
<li>довідки про те, що в тілі та труні (урні) немає вкладень, переміщення яких через державний кордон України заборонено. Таку довідку видає судово-медичний експерт у присутності посадової особи відповідного митного органу - в разі вивезення труни (урни) за кордон - або відповідний компетентний орган іноземної держави з легалізацією такої довідки консульською чи дипломатичною установою України за кордоном - у разі ввезення труни (урни) на територію України.</li>
</ul>
		<p>Тіло померлого повинне вміщуватися в металеву герметичну труну (урну), яка опечатується посадовими особами, зазначеними в абзаці третьому частини першої цієї статті.</p>
		<p>Розкриття труни (урни) можливе у виняткових випадках за наявності достовірної інформації щодо вкладень, переміщення яких через державний кордон України заборонено. Розкриття здійснюється в спеціальному приміщенні закладу охорони здоров’я України в присутності посадової особи митного органу та особи, яка супроводжує труну (урну), або представника підприємства, який здійснює перевезення, а також інших осіб у випадках, передбачених законом, з дотриманням вимог санітарно-епідеміологічного законодавства України.</p>
	</div>}

	
</div>

<a href="https://mail.google.com/mail/u/0/?tab=mm#inbox?compose=CllgCKCBBHxkXJzxzjJzMqXSJdLhlLQsJkkKSnkqWmGJwHhJpqGgSGslKqGMdznsfqhjVZNHfMg" className='shine-button' >Написати інше питання</a>
		</div>
		

	</section>
        </div>
    )
}

export default Helper
